#pragma once
class Rendering {
};
/*Создать шаблонный класс визуализации игры.
  В качестве параметра шаблона должен передаваться класс,
  отвечающий за способ отрисовки игры. Данный класс создает объект класса
  отрисовки игры, и реагирует на изменения в игре,
  и вызывает команду отрисовку.  Реализация должна быть такой,
  что можно масштабировать программу, например,
  реализовать отрисовку в виде веб-страницы без использования
  реализации интерфейса, и просто подставить новый класс в
  качестве параметра шаблона.

*/

